#------------------------------------------------------------------------
# 사용자 정의 함수
#------------------------------------------------------------------------
# 목정/기능 : 2개 정수 덧셈 후 결과 반환
# 함수명 : addTwo
# 파라미터 : num1 num2
# 결과물 : 덧셈값
#-------------------------------------------------------------------------
def addTwo(num1,num2):
    value=num1+num2
    return value

#------------------------------------------------------------------------
# 목정/기능 : 2개 정수 뺄셈 후 결과 반환
# 함수명 : minusTwo
# 파라미터 : num1 num2
# 결과물 : 뺄셈값
#-------------------------------------------------------------------------

def minusTwo(num1,num2):
    value=num1-num2
    return value

#------------------------------------------------------------------------
# 목정/기능 : 정수 리스트 데이터의 합계 반환
# 함수명 : getTotalList
# 파라미터 : nums
# 결과물 : 합계값
#-------------------------------------------------------------------------
def getTotalList(nums):
    total=0
    for num in nums:
        total=total+num

    return total

#------------------------------------------------------------------------
# 목정/기능 : 0개 ~ N개 정수 덧셈 후 결과 반환
# 함수명 : addNum
# 파라미터 : *nums (* 는 0~N개 뜻함)  <=== " 가변인자 " 라고 부름.
# 결과물 : 합계값
#-------------------------------------------------------------------------
def addNum(*nums):
    value=0
    for num in nums:
        value= value+num
    return value

# --------------------------------------------------------------------------
# 함수 사용하기 -> 함수 호출
# --------------------------------------------------------------------------
print(addTwo(2,3))
datas=[5,2,3,4,234]
print(getTotalList(datas))
addNum(1,2,3,4,5,2,32,1,2,3)
addNum(3)
addNum(1,1,1,1)
print(addNum(11,2,2,2))
