# [리스트 자료형 전용의 함수를 메서드(method)] -----------------------
# => 리스트 변수명.메서드()
#----------------------------------------------------------------
score=[98,80,29,30,59] #---> 점수 5개를 하나의 변수명으로 저장하기 (리스트)
print(type(score))


# [추가] -----------------------------------------------------
# (1) append(데이터) => 리스트의 제일 뒤에 추가
# (2) insert(인덱스, 데이터) => 리스트의 특정 위치에 데이터 삽입
#-------------------------------------------------------------
score.append(99) #---> score 리스트 제일 끝에 99추가
print(score,len(score))
score.insert(0,5) #---> score 리스트 0번 요소에 5 추가 삽입
print(score, len(score))


# [정렬] ------------------------------------------------------
# sort => 리스트의 요소 정렬하기
# 요소 값을 순서대로 나열
# 기준: 오름차순(작 -> 큰) ex) 1,2,3,4,..
#      내림차순(큰 -> 작) ex) 10,9,8,7...
# 기본값은 오름차순
#--------------------------------------------------------------
score.sort()
print("정렬 후(오름차순): ",score)
score.sort(reverse=True)
print("정렬 후(내림차순): ",score)

grade=['Z','a','f','c','B']
print(grade, ord('A'),ord('a')) #---> 알파벳) 대문자 < 소문자
grade.sort()
print("정렬 후(오름차순): ",grade)
grade.sort(reverse=True)
print("정렬 후(내림차순): ",grade)


# [뒤집기] ----------------------------------------------------------
# reverse =>현재 데이터를 역순으로 뒤집기 메서드.
# 요소 크기 비교 X
#-------------------------------------------------------------------
score=[91,5,28,99,34,100]
print('전 :',score)
score.reverse()
print('후 :',score)


# [인뎃스 찾기] -------------------------------------------------------
# index(값) => 요소값의 인덱스를 찾아주는 메서드
# 주의) 찾으려는 값이 존재하지 않으면 오류 발생.
# 주의) 리스트에는 find 함수 없음.
#--------------------------------------------------------------------
print(score.index(5), score.index(91))


# [제거] -------------------------------------------------------------
# remove(값) => 요소값을 제거하는 메서드
# 가장 먼저 만나는 값 하나를 제거
# clear
# pop
#--------------------------------------------------------------------
print(score.remove(5),score)
score.append(5)
score.append(5) #----> score리스트 마지막에 5 추가.
score.insert(1,5) #---> score리스트 1번요소에 5 추가삽입.
print(score)
print(score.remove(5),score)
#score.clear() #---> 요소 전체 제거.
print(score)


# [확장]----------------------------------------------------------------
# extend(리스트) => 현재 리스트 확장하는 메서드
# 복합연산자도 있음.
#----------------------------------------------------------------------
score.extend(['a','b','c'])
print(score)

# 리스트 +리스트
a=[1,2,3]
b=['a','b']
a+=b # ---> a= a+b (복합연산자)
print(a)

a=[1,2,3]
a*=3 #---> #a=a*3
print(a)