#  [문자열과 불과 리스트 자료형 이해 220520]
# 1. 문자열 자료형(str) 다루는 문제입니다.
# 1-1. “Happy New Year” 문자열에서 p가 몇 번 나오는지 출력해 주세요.
a = "Happy New Year"
print(a.count("p"))

# 1-2. “Happy New Year” 문자열에서 ‘ Y’의 인덱스를 출력해 주세요.
print(a.index("Y"))

# 1-3. “Happy New Year” 문자열을 “Happy * New * Year”가 되도록 출력하세요.
a= a.split()
print("*".join(a))

# 1-4. 주민번호 “900103-1234567”에서 생년월일을 출력하세요. (예; 1990년 1월 3일 )

b ="900103-2234567"
if b[7]==("1") or b[7]==("2") :
    print(f"19{b[:2]}년 ")
else: print(f"20{b[:2]}년")

print(f'19{b[:2]}년 {b[2:4]}월 {b[4:6]}일')
b=900103-1234567


# 1-5. 주민번호 “900103-1234567”에서 생년월일을 출력하세요. (예; 1990년 1월 3일 )
# 위와 동일

# 1-6. 숫자 2개 5와 3을 사용해서 연산 수행 후 결과를 화면에 보여주세요. (4칙 연산과 몫, 나머지 연산으로 6가지 연산 결과 출력)
print(5+3)
print(5-3)
print(5*3)
print(5/3)
print(5//3)
print(5%3)

# 1-7. “ Good Luck 2022 ” 문자열에서 여백을 제거 후 출력하세요. - 왼쪽 여백만 제거 후 출력 및 길이 출력
a=" Good Luck 2022 "
a= a.lstrip()
print(f'왼쪽여백제거:{a}, 길이:{len(a)}')

# - 오른쪽 여백만 제거 후 출력 및 길이 출력
a=" Good Luck 2022 "
a= a.rstrip()
print(f'오른쪽여백제거:{a}, 길이:{len(a)}')

# - 좌우 여백 제거 후 출력 및 길이 출력
a=" Good Luck 2022 "
a= a.strip()
print(f'좌우여백제거:{a}, 길이:{len(a)}')

# 1-8. “ Good Luck 2022 ” 문자열에을 분리시켜주세요.
a= a.split()
print(f'문자열 분리:{a}')

# 1-9. 문제 1-8에서 분리된 문자열들을 “=:=”기호로 하나의 문자열로 연결해 주세요.
print(f'문자열 연결: {"=:=".join(a)}')

# 1-10. 빈 칸에 들어갈 용어를 채우세요.
# 사람이 사용하는 문자를 컴퓨커가 이해하는 0과 1로 변환하는 것을 _______
#  반대의 경우를 ________라 한다.
# (A) 인코딩, 디코딩

# 1-11. 문자 => 코드값, 코드값 => 문자로 변환하는 코드를 채우세요.
# 'A' 코드값 => (1)
print(f'"A" 코드값: {ord("A")}')
# 97 문자 =>  (2)
print(f'"97" 코드값: {chr(97)}')


# 2. 논리(bool) 자료형 다루는 문제입니다.
# 2-1. 논리 자료형은 무엇인가요? 어떤 데이터를 저장하는지 설명해 주세요.
# (A) Boolean형, True ,False 여부
# 2-2. 아래 데이터를 논리(bool)자료형으로 변환해 주세요.
# “123” => ➀  bool("123")
# ‘ ’ => ➁
# 2022 => ➂
# 8 .9 => ④
# 0 => ⑤
print(bool("123"))
print(bool(' '))
print(bool(2022))
print(bool(-8.9))
print(bool(0))
# 0 이나 없으면 False
# " " 와 같이 공백이라도 있으면 True

# 2-3. 아래 코드에서 결과를 출력 주세요.
num1 =3
num2 =9
print(num1 >= num2)
print(num1 <= num2)
print(num1 == num2)
print(num1 != num2)
s="남"
a=12
print(s=="남" and a>=12)
print(s=="남" or a<12)
print(s!="남")

# 3. 여러 개의 데이터를 저장하는 자료형에 대한 문제입니다..
# 3-1. 데이터 10, 5, 21, 9, 100, 5, 9를 하나의 변수에 저장 후 출력해 주세요.
# 그리고 해당 변수의 타입도 출력해 주세요.
a=[10, 5, 21, 9, 100, 5, 9]
print(a,type(a))
a=(10, 5, 21, 9, 100, 5, 9)
print(a,type(a))
a=10, 5, 21, 9, 100, 5,9
print(a,type(a))
# 3-2. 학생의 정보 이름, 학번, 학교명, 학년을 하나의 변수에 저장 후 출력해 주세요. 그리고 해당 변수의 타입도 출력해 주세요.
name=" 황보미"
number=2013105108
school="k대"
grade = 1
print(type(name))
print(type(number))
print(type(school))
print(type(grade))

# 3-3. 국어점수 5개, 수학점수 5개, 영어점수 5개를 하나의 변수에 저장 후 출력해
#      주세요. 그리고 해당 변수의 타입도 출력해 주세요.

language=[1,2,3,4,5]
math=[6,7,8,9,10]
english=[11,12,13,14,15]
a=[language,math,english]
print(a, type(a))

# 3-4. 문제 3-3에서 국어점수만 출력해주세요. 그리고, 국어점수에서 첫 번째, 3번째, 마지막 번째 점수만 또 출력해 주세요.
print(a[0])
print(a[0][0], a[0][2], a[0][-1])
print(a[0][::2])

# 3-5. 문제 3-3에서 국어점수, 수학점수, 영어점수 각각의 합을 출력해 주세요
print('국어점수: ',a[0][0]+a[0][1]+a[0][2]+a[0][3]+a[0][4])
print('수학점수: ',a[1][0]+a[1][1]+a[1][2]+a[1][3]+a[1][4])
print('영어점수: ',a[2][0]+a[2][1]+a[2][2]+a[2][3]+a[2][4])
print(sum(a[0]))
print(sum(a[1]))
print(sum(a[2]))