# ---------------------------------------------------------------
# 구구단 전체를 출력하는 프로그램
# ---------------------------------------------------------------
print('----for문으로 구구단 출력----')
for dan in range(2,10):
    print(f'---{dan}단---')
    for num in range(1,10):
        print(f'{dan}*{num}={dan * num}')

# ---------------------------------------------------------------
# 숫자문자열의 합계 구하는 프로그램
# ---------------------------------------------------------------
print('----for문으로 숫자문자열의 합계 구하는 프로그램----')
money='123,456,789' #---> for문의 요소 낱개를 분리해서 빼옴.
total=0
for n in money: #---> '1 2 3 , 4 5 6 ,7 8 9' 로 분리
    if n==',': continue
    total=total+int(n)
    print(n,total)

# ---------------------------------------------------------------
# 문자열에 대한 코드값 출력하는 프로그램
# 문자 => 코드 알려주는 내장함수 : ord(문자 1개)
# 코드 => 문자 알려주는 내장함수: chr(코드 1개)
# ---------------------------------------------------------------
print('----문자열에 대한 코드값 출력하는 프로그램----')
msg="2022 Happy Year~!"
codemsg=""

for n in msg:
    print(f'{n}의 코드 : {ord(n)}, {bin(ord(n))},{hex(ord(n))}')
    codemsg=codemsg+bin(ord(n))
print(codemsg)