#---------------------------------------------------------------
# [조건부 표현식] ===> 삼항연산자
# - if ~ else 구문을 1라인으로 표현
# - (형태) : True일 때, 실행코드 if 조건식 else False일 때 실행 코드
#                     1          2      3        4
#---------------------------------------------------------------
score=79

if score>=60:
    print("합격")
else:
    print("불합격")

print("합격") if score>=60 else print("불합격")

# 두 개의 숫자를 입력 받아서 나눗셈 하는 프로그램
n1, n2=1,2
print(n1/n2)

print(n1/n2) if n2 != 0 else print(f" {n2}로는 나눌 수 없습니다.")


# [ 문제 ] --------------------------------------------------------------
# 숫자가 양수, 음수, 0 중 어느것인지 출력하기
# 조건부 표현식 사용
#-----------------------------------------------------------------------
n=input("숫자 입력:")
n= int(n)
msg= "양수" if n>0 else "음수" if n<0 else "0"
print(f'{n} -> {msg}')