#----------------------------------------------------------------------------
# 변수 복사 실습
#-----------------------------------------------------------------------------
# a=b 인 경우, a와 b는 완전히 같다.
a=[1,2,3,[11,22]]
b=a #---> 이 경우, a와 b는 완전히 같다.
c=a[:] #---> (얕은 복사) 이 경우, 다른 주소에 저장됨. 같지 않다.
# 같은 복사 기능을 가진 모듈을 추가
import copy #---->(깊은 카피) : 요소를 변경해도 처음 복사한 값 그대로 유지.
d=copy.deepcopy(a)

print(f'a의 id : {id(a)}\nb의 id : {id(b)}\nc의 id: {id(c)}\nd의 id: {id(d)}') # 주소 a=b, c는 다름.

a[0]='A' #---> c는 바뀌지 않음.
a[3][0] = 2022 #---> c도 바뀜. (c의 얕은 복사 경우, 모든 변수가 같이 변경됨) , d는 깊은 복사로 변경 사항이 바뀌지 않음.
print(a,b,c,d)
print(f'a is b => {a is b}')
print(f'a is c => {a is c}')
print(f'a is d => {a is d}')

print( 10 is 10.0) #---> False : 타입까지 봄.
print( 10 == 10.0) #---> True : 숫자만 봄.

# d=c.copy()  이것도 얕은 카피.

# 깊은 복사 기능을 가진 모듈을 추가해야 됨.



