#--------------------------------------------------------------------------------
# 집합 자료형(set)
#--------------------------------------------------------------------------------
# - 중복 데이터 제거 후 저장
# - 인덱스 X, 키 X, 순서 X
# - 생성 : set(), {1,54,2}
#--------------------------------------------------------------------------------


sData1={1,2,4} #---> 집합 자료형 생성
sData2=set() #---> set은 비어있을 때, set()이라고 표시해야 함. ( 비어있는 dict와 구별하기 위함.)
sData3=set([1,1,4,7,3,2,7])
sData4=set("Good Happy")
print(f'sData1의 타입: {type(sData1)} 갯수: {len(sData1)} 데이터: {sData1}')
print(f'sData2의 타입: {type(sData2)} 갯수: {len(sData2)} 데이터: {sData2}')
print(f'sData3의 타입: {type(sData3)} 갯수: {len(sData3)} 데이터: {sData3}')
print(f'sData4의 타입: {type(sData4)} 갯수: {len(sData4)} 데이터: {sData4}')

# sdata5=set(1,2)) ---> 숫자는 set 불가능. (리스트, 튜플은 가능.)
# sdata6=set((1)) ---> 튜플은 요소가 하나일 때, 따옴표 해줄 것.
sData5=set([1,2])
sData6=set((1,))
print(sData5)
print(sData6)
