# [입력받기] ----------------------------------------------------------------------
# input("입력 받고 싶은 메시지") => 키보드로 입력받기 함수
# 키보드로 입력 후 엔터키(Enter) 입력하면 컴퓨터로 전달.
# 변수에 입력받은 데이터 저장
# input을 통해 들어오면 모두 문자로 인식.
#--------------------------------------------------------------------------------
# age=input("나이를 입력하세요.")
# print(f'당신은 {age}이군요. type: {type(age)}') #---> 결과창에 데이터 줘야함.

nums=input("숫자 2개를 입력하세요.(예:10,2)") #---> input을 통해 들어오면 모두 문자(str)로 인식.
print(f'nums => {nums} type: {type(nums)}')

# 입력받은 문자열 분리하기 => split(구분문자)
nums=nums.split(',') #---> list가 됨.
print(f'nums => {nums} type: {type(nums)}')

#숫자를 입력하지 않을 시, 조건문을 이용해서 대처해야 함.
nums[0]=int(nums[0]) #---> 정수로 변환
nums[1]=int(nums[1])
print(f'nums => {nums} type: {type(nums)}')

