#-----------------------------------------------
#Practice_01
# 1.컴퓨터 메모리에 데이터를 저장하는 문법을 적으세요.
# 1-1.영화제목을 컴퓨터 메모리에 저장해주세요.
# 1-2.학번, 전공, 이름, 학년을 컴퓨터 메모리에 저장해 주세요.
# 1-3.전화번호, 이메일을 컴퓨터 메모리에 저장해 주세요.
MovieTitle="범죄도시"
Number=2013104155
Name="SHIN_MINSU"
Class="졸업"
Phone_Number="010-9594-6754"
email="minsu0707@naver.com"
#-----------------------------------------------
#Practice_02
# 1.컴퓨터 메모리에 저장된 데이터를 읽어오는 문법을 적으세요.
# 2-1.컴퓨터 메모리에 저장된 영화제목을 읽어서 화면에 출력해 주세요.
# 2-2.컴퓨터 메모리에 저장된 학번, 이름, 학년을 읽어서 화면에 출력해 주세요
# 2-3.컴퓨터 메모리에 저장된 전화번호, 이메일을 읽어서 화면에 출력해 주세요.
print(MovieTitle)
print(Number,Name,Class)
print(Phone_Number,email)
#------------------------------------------------
#Practice_03
# 3.컴퓨터 메모리에 저장된 영화제목을 가지고 오는 변수에 대한 문제입니다.
# 3-1.변수에 저장된 값을 가지고 오세요.
# 3-2.변수에 저장된 값을 가지고 와서 화면에 출력해 주세요.
MovieTitle
print(MovieTitle)
#------------------------------------------------
#Practice_04
# 4.재료를 주면 특정 기능을 수행할는 것을 무엇이라 하나요?
# A)함수