# [ return ] --------------------------------------------------------
# 함수 반환값 => return 결과
# ** return 키워드
# - 함수, 조건문, 반복문
# 원래 있던 곳으로 다시 돌아가는 기능
# -------------------------------------------------------------------
def getAdd(num1, num2):
    return num1 + num2

def noData():
    print("noData입니다.")
    return
print(getAdd(1,2))
# print(getAdd(1)) #---> num2에 초기값을 설정하면 이렇게 사용가능
print(noData())

# [문제 2] -----------------------------------------------------------
# 기    능: 4칙 연산 수행 결과 반환하는 함수
# 함 수 명: calcFour
# 파라미터: num1, num2
# 반 환 값: 덧셈, 뺄셈, 곱셈, 나눗셈 결과
# -------------------------------------------------------------------
def calcFour(num1, num2):
    return num1+num2,num1-num2,num1*num2,num1/num2 if num2 != 0 else "0은 분모가 될 수 없습니다."

print(f"[4칙 연산 결과] {calcFour(-1,0)}")