#----------------------------------------------------------------------
# 제어문 => 코드 실행 순서 및 실행 여부, 실행 횟수를 결정하는 문법.
#
# - 조건문 => 조건에 해당하는 경우, 실행되는 코드와 실행되지 않는 코드를 결정하는 문법
# - (형식) if 조건 :
#           실행코드
# 들여쓰기, (:) 꼭 할 것!


# 문제1)-----------------------------------------------------------------------
# 숫자를 입력 받아 짝수이면 "짝수군요~" 라고 출력하는 프로그램.
# (1) 숫자 입력 받기
# (2) 숫자가 짝수인지 홀수인지 검사
# (3) 숫자가 짝수일 때만 출력
#-----------------------------------------------------------------------
runnumber=input("runnumber(1=> 홀수,짝수 구별하기 2=> 양수,음수 구별하기  3=> 양수,음수,0 구별하기): ")
runnumber=int(runnumber) #--->input은 문자열을 받기 때문에 int로 형변환 해줘야함.

if runnumber==1:
    # (1) 입력받기 => 타입 str ---> 타입 int 변환
    num=input("좋아하는 숫자 입력: ")
    num = int(num)

    # (2) 짝수인지 홀수인지 검사 => 숫자 %2 => 나머지 0이면 짝수, 0 아니면 홀수
    print(num%2,num%2==0, num%2 !=0)
    if num%2==0:
        print(f'당신은 짝수 {num}을 좋아하는군요~')
    else:
        print(f'당신은 홀수 {num}을 좋아하는군요~')

    if num%2:    #---> 1=true, 0=false로 자동 저장 되어 있음.
            print(f'당신은 홀수 {num}을 좋아하는군요~')
    else:
            print(f'당신은 짝수 {num}을 좋아하는군요~')

    if not num%2==0: #---> (1이면 False. 0이면 True)
        print(f'당신은 홀수 {num}을 좋아하는군요~')
    else:
        print(f'당신은 짝수 {num}을 좋아하는군요~')

# 문제2) 숫자 입력 받아 양수 & 음수 구별하는 프로그램 ---------------------------
elif runnumber==2:
    num=input("숫자 입력: ")
    num=int(num)
    if num >0:
        print(f'{num}는 양수입니다.')
    else:
        print(f'{num}는 음수입니다.')

    print("=== The End===")

# 문제3) 숫자를 입력 받아 양수,0,음수를 구별하는 프로그램---------------------------------------
# 조건1 --- 0보다 큰수
# 조건2 --- 0보다 작은수
# 조건 2개 이상 되는 조건문 ===> 다중 조건문
# 형식 => if 조건1:
#            실행코드
#         elif 조건2:  elif는 앞에서 True면 나머지 elif 검사하지 않음.
#            실행코드
#            ....
#         else:
#            실행코드

elif runnumber==3:
    num=input("숫자 입력: ") #---> num은 키보드로 입력 받아서 str 형태이므로 형변환 필요.
    num=int(num)
    if num > 0:
        print(f'{num}은 양수입니다.')
    elif num < 0:
        print(f'{num}은 음수입니다.')
    else:
        print(f'{num}은 0입니다.')


# 실행코드가 마땅히 없을 때, pass 사용.-------------------------------------------
# if num>0:
#    pass
# else:
#    print()
# 또는 if num>0: pass
#     else: print() 처럼 한 줄씩 더 간결하게 사용할 수 있음.
# (!) 실행코드가 하나일 때, if 바로 옆에 붙일 수 있다.------------------------------
# 조건부 표현식 ---------------------------------------------------------------
# 실행코드가 하나일 때, if 바로 옆에 붙일 수 있다.
# -형태: 조건문이 참인 경우 if 조건문 else 조건문이 거짓일 경우
# message ="success" if score >=60 else "failure"
