#--------------------------------------------------------------------------
#
#--------------------------------------------------------------------------

# [문제 1]
# 1~1000 범위에서 2의 배수만 저장하는 데이터를 생성하고,
# 그 데이터의 모든 요소를 출력하세요.
#--------------------------------------------------------------------------
#방법1
#nums=range(1,1001)
#nums=list(nums)
#print(nums)
#nums2=nums[1::2]
#print(nums2)

#방법2
#nums=list(range(2,1001,2))
#print(nums)

#방법3
# if nums[0]%2==0: nums2.append(nums[0])
# if nums[1]%2==0: nums2.append(nums[1])
# if nums[2]%2==0: nums2.append(nums[2])
# if nums[3]%2==0: nums2.append(nums[3])
# 너무 많음. ---> while 사용해야함.

#방법4 -while 활용
nums=list(range(1,1001))
nums2=[]

count=0
while count<1000:
    if nums[count] % 2 ==0:
        nums2.append(nums[count])
    count=count+1
print(nums2)

# [문제 2] ----------------------------------------------------------------
# 사용자로부터 데이터를 입력 받아서 저장합니다.
# 몇 개의 데이터를 입력 받을 지 모릅니다.
# 단, 사용자가 'q'를 입력하면 종료해 주세요.
#-------------------------------------------------------------------------
datas=[]

while True:
    d=input("저장하고 싶은 데이터를 입력하세요.")
    if d != 'q': datas.append(d)
    else: break

while True:
    d=input("저장하고 싶은 데이터를 입력하세요.")
    if d == 'q': break  # 반복 중단하는 조건

    datas.append(d)
print(d)

# [문제 3]------------------------------------------------------------------
# 구구단 3단 출력
#--------------------------------------------------------------------------
count=1
while count<10:
    print(3*count)
    count=count+1