#-----------------------------------------------------------------------
# 문자 자료형 => 문자열 string ---> str 타입
#-----------------------------------------------------------------------
# 이스케이프 코드 "\", '\', 따옴표와 백슬래쉬를 이용한 기능
movieTitle='닥터스트레인지'
schoolName="대학"
msg='\'한글\'\t입니다.'

msg2="'한글'\n입니다."
path='C:\\Users\\USER\\.conda'
path2=r'C:\Users\USER\.conda'
# 모니터 화면에 출력하기 => print() 함수
print(msg, msg2,path,path2)

# --------------------------------------------
# 문자열 타입(str) 연산하기
# 덧셈 +, 곱셈 * 만 동작함
#--------------------------------------------
name ="SHIN"
addr="Daegu"
strAdd=name+addr+'\n'+"2022"+"    "+"haha"
print("문자열 더하기",strAdd)
print("\n")
print("Zzz")

# 문자 + 숫자 => 불가합니다. ===> 자료형을 통일 시켜야 함.
# 문자 + 문자 or 숫자 + 숫자
# 자료 형변환 이라고 함(Type Casting, 타입 캐스팅)
print("ABC"+str(2020))
print(int("531")+2022)
# 숫자 ---> 문자: str()만 해주면 됨
# 문자 ---> 숫자: int, float 사용할 경우 조건이 있음. 따옴표 안에 있는 것이 아라비아 숫자여야 함.

#-----------------------------------------------------
#문자열 곱셈 => 문법 : 문자 * 숫자 (순서를 지켜야 함)
print("ABC"*3)
print("-"*10)
