#--------------------------------------------------------------------------------
# 문자열 자료형(str) 다루기
#-------------------------------------------------------------------------------
msg = "Happy Christmas"

# 컴퓨터 메모리에 저장된 데이터 읽어오기(가져오기)
msg

# 컴퓨터 메모리에 저장된 데이터 읽어(가져)와서 화면에 출력하기
print(msg)

#----------------------------------------------------
# 문자열 안에 있는 문자 1개 1개를 요소(element)라고 함
# 구별하기 위해서 번호를 부여함 => 인덱싱
# 왼쪽 ==> 오른쪽 0, 1, 2,....
# 오른쪽 ===> 왼쪽 -1, -2,....
# 요소(element) 읽기(가져오기) 문법 => 변수명[인덱스]
#----------------------------------------------------
data="hello"
#     01234
#  (-)54321
# 첫번째 요소 읽기(가져오기) & 출력
print("전     체 : " ,data)
print("첫번째요소 : ", data[0])
print("마지막요소 : ", data[-1])
print("마지막요소 : ", data[4])
print("'ㅣ' 요소 : ", data[2])

# msg=" Happy Christmas" , Christmas만 출력하기------------------------------------
#       012345678910111213
print(msg[6],msg[7],msg[8],msg[9],msg[10],msg[11],msg[12],msg[13],msg[14])

# 슬라이싱  : 문자열에서 가져오고 싶은 요소의 범위 지정
# 문법: 변수명[시작인덱스:끝인덱스+1]

# 마지막 요소까지 범위 지정 시 끝인덱스 생략가능.
print(msg[6:15],msg[6:])
# 0번 요소부터 범위 지정시 시작인덱스 생략가능.
print(msg[0:6], msg[:6])
# 0번 요소부터 끝까지 가져와서 출력
print(msg[0:15], msg[0:], msg[:15],msg[:])


