#--------------------------.upper(), .lower()-----------------------------------------
# 대소문자 변환 메서드 => str.upper(), str.lower()
# 파일에 데이터를 가지고 와서 알파벳 개수 체크할 때 사용.
# 비밀번호 대소문자 통일시킬 때 사용.
#---------------------------------------------------------------------
msg="Good Luck"
msg=msg.upper() #---------> msg에 GOOD LUKC 저장됨.
print(f"msg : {msg}")
print(msg)

print(msg.lower()) #----------> msg에 저장되지 않음.
print(msg)


#-------------------------.strip()--------------------------------------------
# 문자열 데이터 좌우공백 제거하는 메서드
# str.strip(), str.lstrip(), str.rstrip()
# 단, 'aaa', "   aaa nnn " ---> 좌우의 공백만 제거, 문자 사이는 관계없음.
#---------------------------------------------------------------------
msg="  Happy New Year  "
print("원본: ", msg)
print("좌우: ",msg.strip())
print("우측: ",msg.rstrip())
print("좌측: ",msg.lstrip())


#-------------------------.replace()---------------------------------------------
# 문자열 데이터 안에서 일부 변경해주는 메서드
# str.replace(old, new, (갯수))
# 갯수 설정하지 않으면 전부 변경
# 갯수 설정하면 지정된 갯수만큼만 변경
#----------------------------------------------------------------------
msg='pithon i i i '
msg1= msg.replace('i','y')   #---> 갯수 설정X
print(msg1)
msg2= msg.replace('i','y', 2) #---> 갯수 설정O
print(msg2)


#------------------------.split()-----------------------------------------------
# 문자열 데이터를 쪼개는(나누어주는) 메서드
# str.split() : 기본값은 공백을 기준으로 나눔.
#-----------------------------------------------------------------------
msg=' Happy New Year 2022 '
result= msg.split()
print(f'result => {result}')

msg=' 010-222-2222 '
result= msg.split('-')
print(f'result => {result}')

path='C:\Program Files\Google'
result= path.split('\\')
print(f'result => {result}')


#----------------------.join()------------------------------------------------
# 문자열들을 합쳐서 하나의 문자열을 만들어주는 메서드
# "합쳐줄 문자".join(여러개의 문자열)
#----------------------------------------------------------------------
print('*'.join(result))
print('*'.join(msg))


#-----------------------ord(), chr()----------------------------------------------
# 인코딩: 언어-> 2진수
# 디코딩: 2진수 -> 언어
# 테이블마다 인코딩이 다름. (깨져서 나오면 테이블이 맞지 않는 것)
# 요즘 우리나라는 UTF8 사용(한글이 들어 있음)
# 영어권은 아스키테이블 사용.
#----------------------------------------------------------------------
# 문자에 해당하는 코드값 알려주는 내장함수.
# ord('문자1개'), 10진수가 기본설정
# 코드에 해당하는 문자값 알려주는 내장함수.
# chr(10진수 코드값), 10진수가 기본설정
#----------------------------------------------------------------------
print(" A: ", ord('A'), hex(ord('A')))
print(" B: ", ord('B'), bin(ord('B')))
print(" a: ", ord('a'), hex(ord('a')))
print(" b: ", ord('b'), bin(ord('b')))

print("code97: ", chr(97))
print("code65: ", chr(65))

